{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"RNN","config":{"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"cell":{"class_name":"StackedRNNCells","config":{"cells":[{"class_name":"LSTMCell","config":{"units":100,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell1","trainable":true}}],"name":"stacked_rnn_cells_StackedRNNCells1","trainable":true}},"name":"rnn_RNN1","trainable":true,"batch_input_shape":[null,10,8],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true}},{"class_name":"RNN","config":{"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"cell":{"class_name":"StackedRNNCells","config":{"cells":[{"class_name":"LSTMCell","config":{"units":50,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell2","trainable":true}}],"name":"stacked_rnn_cells_StackedRNNCells2","trainable":true}},"name":"rnn_RNN2","trainable":true}},{"class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true}},{"class_name":"RNN","config":{"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"cell":{"class_name":"StackedRNNCells","config":{"cells":[{"class_name":"LSTMCell","config":{"units":10,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell3","trainable":true}}],"name":"stacked_rnn_cells_StackedRNNCells3","trainable":true}},"name":"rnn_RNN3","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}}]},"keras_version":"tfjs-layers 1.7.4","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"rnn_RNN1/RNNCell_0/kernel","shape":[8,400],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_0/recurrent_kernel","shape":[100,400],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_0/bias","shape":[400],"dtype":"float32"},{"name":"rnn_RNN2/RNNCell_0/kernel","shape":[100,200],"dtype":"float32"},{"name":"rnn_RNN2/RNNCell_0/recurrent_kernel","shape":[50,200],"dtype":"float32"},{"name":"rnn_RNN2/RNNCell_0/bias","shape":[200],"dtype":"float32"},{"name":"rnn_RNN3/RNNCell_0/kernel","shape":[50,40],"dtype":"float32"},{"name":"rnn_RNN3/RNNCell_0/recurrent_kernel","shape":[10,40],"dtype":"float32"},{"name":"rnn_RNN3/RNNCell_0/bias","shape":[40],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[10,1],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.7.4","convertedBy":null}